{
    "amazon_product": {
        "title": "HTC Desire 626S No Contract Phone White (Virgin Mobile)",
        "description": "Shop cell phones and accessories at Amazon.com. You'll find great prices on cases, headsets, and the latest smartphones from carriers like Verizon, AT&T, and Sprint",
        "price": "$73.99",
        "overall_rating": "4.1 out of 5 stars",
        "text_keywords": "mobile phone",
        "location": "http://www.amazon.com/HTC-Desire-Contract-Virgin-Mobile/dp/B014X5UZJI",
        "main_images": [
            {
                "location": "http://ecx.images-amazon.com/images/I/71f6fGD3MQL._SL1500_.jpg",
                "download_status": "UNPROCESSED"
            }
        ],
        "reviews": [
            {
                "rating": "5 stars",
                "description": "I got THE HTC DESIRE 626 on Sale for $99 from best buy after reading many negative reviews. Despite the poor reviews I bought the phone because the hardware speaks for itself. The biggest advantage this phone has over the Moto E is the 1.5gb of RAM. The extra memory really makes the phone speedy and you don't have to refresh screens so often. On the downside the phone is flooded with bloatware from HTC and doesn't come with some common Google Apps. There are about 20 HTC APPS that cannot be removed however after updating everything you're left with about 3gb of internal storage. On the bright side the phone holds an impressive 200gb external SD CARD, making this a media powerhouse. I played 2 high end games to test the hardware and they both ran fine. This is a very elegant looking phone with an impressive 5 inch display. Perfect for fitting in your pocket. It's made of all plastic and very slippery so I highly recommend a rugged case otherwise it will slip out of your hands. Bottom line is that this is the top low end phone that is excellent for work and play.",
                "title": "Best low end phone."
            },
            {
                "rating": "4 stars",
                "description": "I found a prince in the HTC Desire 626s. After years of replacing every entry-level Virgin Mobile smartphone within 12 months thanks to shortcomings of one sort of another I was sure I had at last found a winner in the Samsung Galaxy SIII, which I purchased at a very large big-box retailer earlier this year. My Galaxy, however, stuttered when I texted — resulting in a lot of errors due to the phone's failure to keep up with my rather slow rate of speed.  The other headache: The Galaxy SIII wouldn't reliably link up to my Kenwood head unit for Pandora streaming. Worse, even when I wasn't using a hands-free bluetooth connection, callers sometimes complained that my voice clipped and dropped out. (Which I blamed on the network, initially, when in reality it was my phone.)In search of a solution, I \"downgraded\" recently to the cheaper-but-newer HTC Desire 626s. For the first time in two years the problems I began encountering first with LG's Volt and then with my Samsung Galaxy SIII have been solved: The HTC Desire 626s works beautifully hands-free in my car using Google's alternative to HTC's hard-of-hearing dialer app. Another pleasant surprise: Call clarity is much improved both in terms of hearing other callers and their experience in talking with me.Perhaps most unexpectedly, the HD screen is particularly nice. I have owned a number of smartphones that offered very bright, vivid colors but this screen, more than just being colorful, is tack sharp. Unlike the other smartphones I've owned, there isn't a ton of glare coming off HTC's screen and so the look of the screen is more akin to a colorful page of print, not your typical back-lit LED screen look.Read more ›",
                "title": "After Kissing Toads…"
            },
            {
                "rating": "3 stars",
                "description": "It is a great phone . I hav an HTC One m8 and I loved it so I decided to stick with HTC. There are a few down sides to the phone. It has very low speaker volume, low camera quality, the over all display is not on the same level as any iPhone or Samsung but it is not a bad phone for the price.I am satisfied with its performance.",
                "title": "It is a great phone. I hav an HTC One m8 and ..."
            },
            {
                "rating": "5 stars",
                "description": "It's an awesome phone perfect battery life and screen resolution. I would definitely recommend this to anyone wanting a good phone. It has predictive text that makes life so much easier. The cameras are good. The phone does take a while to load everything the first time it's turned on but other than that it's perfect",
                "title": "Best phone ever"
            },
            {
                "rating": "5 stars",
                "description": "I was somewhat hesitant to buy through a party not providing the service (ie not Virgin) but the phone came in retail package. Set up was great and a month or so out it works great. Really glad I gave it a shot as Virgin has a limited number of phones available,",
                "title": "Very Happy"
            },
            {
                "rating": "4 stars",
                "description": "Very happy with the phone. The screen is nice and big, the battery is great and its less than 200 hundreds. The only bad thing is it has only 8 gig of internal memory.",
                "title": "Very happy with the phone"
            },
            {
                "rating": "5 stars",
                "description": "Awesome but it upgrades a lot.",
                "title": "HTC Desire 626s"
            },
            {
                "rating": "1 stars",
                "description": "When the phone works, it's not bad (despite running out of storage space before even downloading all of the apps I use on a daily basis). I could survive with not enough storage space. What I can't live with is a phone that keeps breaking on me. Less than a month after purchasing my phone, it quit charging. It died one evening, and when I plugged it in, it wouldn't charge. I tried all of our chargers, and it still wouldn't charge. I called Virgin Mobile, and they said it's still under warranty through the store to return it. I did (last week, Thanksgiving morning), and they exchanged it for a new phone. 6 days later, same thing happens! It was working fine but the battery was dying. It died, and as soon as I got home to a charger and plugged it in, it wouldn't charge. It is very inconvenient to have to replace your phone just because the battery dies! I'm off to get my money back and go back to a Galaxy.",
                "title": "it's not bad (despite running out of storage space before even downloading ..."
            }
        ],
        "companion_products": [
            {
                "price": "$73.99",
                "location": "http://www.amazon.com/Desire-LK-Shockproof-Defender-Protective/dp/B011QLL5DC/ref=pd_sim_107_1?ie=UTF8&dpID=51oaeSjzIuL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1GCVNVMJ1225B1XRESPB",
                "title": "HTC Desire 626 / 626s Case, LK [Shockproof] Hybrid Dual Layer Armor Defender Protective Case Cover for HTC Desire 626 / 626s (Black)",
                "download_status": "UNPROCESSED"
            },
            {
                "price": "$73.99",
                "location": "http://www.amazon.com/SUPERSHIELDZ-Anti-Bubble-Definition-Protector-Replacements/dp/B011WENBD0/ref=pd_sim_107_2?ie=UTF8&dpID=51IlJE1cbUL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1GCVNVMJ1225B1XRESPB",
                "title": "[6-Pack] SUPERSHIELDZ- Anti-Bubble High Definition Clear Screen Protector For HTC Desire 626s 626 + Lifetime Replacements Warranty - Retail Packaging",
                "download_status": "UNPROCESSED"
            },
            {
                "price": "$73.99",
                "location": "http://www.amazon.com/HTC-Desire-626s-626-Ultra-sensitive/dp/B011QCWZ0S/ref=pd_sim_107_3?ie=UTF8&dpID=51UAMEXQ70L&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1GCVNVMJ1225B1XRESPB",
                "title": "HTC Desire 626s Case, HTC Desire 626 Case, ATUS® Heavy Duty Dual Layer Holster Case Kick Stand with Locking Belt Swivel Clip + Ultra-sensitive Stylus Pen (BLACK/BLACK)",
                "download_status": "UNPROCESSED"
            },
            {
                "price": "$73.99",
                "location": "http://www.amazon.com/Desire-LK-Shockproof-Defender-Protective/dp/B011QLL8R0/ref=pd_sim_107_4?ie=UTF8&dpID=515ME1N2JsL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1GCVNVMJ1225B1XRESPB",
                "title": "HTC Desire 626 / 626s Case, LK [Shockproof] Hybrid Dual Layer Armor Defender Protective Case Cover for HTC Desire 626 / 626s (Blue)",
                "download_status": "UNPROCESSED"
            },
            {
                "price": "$73.99",
                "location": "http://www.amazon.com/TechFilm%C2%AE-Protector-Ultra-Clear-Anti-Scratch-Anti-Fingerprint/dp/B011WFWFYK/ref=pd_sim_107_5?ie=UTF8&dpID=51RXF7JGYPL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1GCVNVMJ1225B1XRESPB",
                "title": "TechFilm®- HTC Desire 626s 626 [Tempered Glass] Screen Protector, Premium Ballistic Glass Round Edge [0.3mm] Ultra-Clear Anti-Scratch, Anti-Fingerprint, Bubble Free [1 Pack]- Retail Packaging",
                "download_status": "UNPROCESSED"
            },
            {
                "price": "$73.99",
                "location": "http://www.amazon.com/SanDisk-MicroSD-MicroSDHC-Gigabyte-Butterfly/dp/B00NAGIANK/ref=pd_sim_107_6?ie=UTF8&dpID=41BkcqPLpHL&dpSrc=sims&preST=_AC_UL160_SR160%2C160_&refRID=1GCVNVMJ1225B1XRESPB",
                "title": "32GB SanDisk MicroSD HC MicroSDHC Memory Card 32G (32 Gigabyte) for HTC Desire 816 610 616 601 600 516 510 500 310 300 210 One E8 Mini 2 Max Butterfly 2 with SoCal Trade, Inc. MicroSD & SD USB Memory Card Reader",
                "download_status": "UNPROCESSED"
            }
        ],
        "specifications": [
            {
                "name": "Size (LWH):",
                "value": " 5.78 inches, 2.79 inches, 0.32 inches"
            },
            {
                "name": "Weight:",
                "value": " 4.96 ounces"
            },
            {
                "name": "Battery Type:",
                "value": " Lithium Ion"
            }
        ],
        "download_status": "DOWNLOAD_DONE",
        "mm_name": "amazon_product"
    }
}